## Цей файл містить параметри, які можна змінити для налаштування вашої гри.
##
## Рядки, що починаються з двох знаків '#', є коментарями, і ви не повинні їх розкоментувати.
## Рядки, що починаються з одного знака '#', це закоментований код, який можна розкоментувати при потребі.


## Основи ######################################################################

## Людсько зрозуміле ім'я гри. Використовується для встановлення заголовка вікна за замовчуванням
## та відображається в інтерфейсі і звітах про помилки.
##
## Окруження _() в рядку позначає, що його можна перекладати.

define config.name = _("EchoesOfThePast")


## Визначає, чи буде відображатися назва гри на головному екрані меню. 
## Встановіть False, щоб приховати назву.

define gui.show_name = True


## Версія гри.

define config.version = "1.0"


## Текст, що відображається на екрані "Про гру". Текст пишеться між трійними лапками,
## і залиште порожній рядок між абзацами.

define gui.about = _p("""
""")


## Коротке ім'я для гри, яке використовується для виконуваних файлів і директорій в розподілі гри.
## Це повинно бути тільки ASCII і не містити пробілів, двокрапок або крапок з комою.

define build.name = "EchoesOfThePast"


## Звуки та музика ############################################################

## Ці три змінні контролюють, серед іншого, які мікшери показуються гравцю за замовчуванням.
## Якщо одну з них встановити в False, відповідний мікшер не буде відображатися.

define config.has_sound = True
define config.has_music = True
define config.has_voice = True


## Щоб дозволити гравцю відтворити тестовий звук на каналі звуку чи голосу,
## розкоментуйте одну з ліній нижче і використовуйте її для встановлення звуку, який буде відтворюватися.

# define config.sample_sound = "sample-sound.ogg"
# define config.sample_voice = "sample-voice.ogg"


## Розкоментуйте наступну лінію, щоб встановити аудіофайл, який буде відтворюватися, поки гравець на головному меню.
## Цей файл буде відтворюватися і під час гри, поки не буде зупинений або замінений іншим файлом.

# define config.main_menu_music = "main-menu-theme.ogg"


## Перехід між екранами #################################################################
##
## Ці змінні встановлюють переходи, які використовуються при певних подіях.
## Кожну змінну потрібно встановити на перехід або None, якщо перехід не потрібен.

## Вхід або вихід з ігрового меню.

define config.enter_transition = dissolve
define config.exit_transition = dissolve


## Перехід між екранами ігрового меню.

define config.intra_transition = dissolve


## Перехід після завантаження гри.

define config.after_load_transition = None


## Перехід, який використовується при вході в головне меню після закінчення гри.

define config.end_game_transition = None


## Змінної для переходу на початку гри не існує.
## Замість цього використовуйте оператор with після показу початкової сцени.


## Керування вікнами ###########################################################
##
## Це налаштовує, коли вікно діалогу відображається. Якщо "show", воно завжди відображається.
## Якщо "hide", воно відображається тільки тоді, коли є діалог. Якщо "auto", вікно приховується
## перед заявами сцени і показується знову, коли з'являється діалог.
##
## Після початку гри це можна змінити за допомогою операторів "window show", "window hide", та "window auto".

define config.window = "auto"


## Перехід для показу та приховання вікна діалогу

define config.window_show_transition = Dissolve(.2)
define config.window_hide_transition = Dissolve(.2)


## Налаштування за замовчуванням ##################################################

## Контролює стандартну швидкість тексту. За замовчуванням, 0 — це нескінченний час,
## а інше число — це кількість символів на секунду.

default preferences.text_cps = 0


## Стандартна затримка авто-переходу. Великі числа призводять до довших пауз,
## при цьому діапазон від 0 до 30 є допустимим.

default preferences.afm_time = 15


## Каталог для збережень ######################################################
##
## Визначає платформенне місце для збереження файлів гри. Файли збережень будуть збережені в:
##
## Windows: %APPDATA\RenPy\<config.save_directory>
##
## Macintosh: $HOME/Library/RenPy/<config.save_directory>
##
## Linux: $HOME/.renpy/<config.save_directory>
##
## Зазвичай це не слід змінювати, і якщо змінювати, то завжди використовувати буквений рядок, а не вираз.

define config.save_directory = "EchoesOfThePast-1745492840"


## Іконка ######################################################################
##
## Іконка, яка відображається на панелі задач чи доку.

define config.window_icon = "gui/window_icon.png"


## Налаштування побудови ########################################################
##
## Цей розділ контролює, як Ren'Py перетворює ваш проект на файли для розповсюдження.

init python:

    ## Наступні функції використовують шаблони файлів. Шаблони нечутливі до регістру
    ## і порівнюються з шляхом відносно базового каталогу, з і без початкового /.
    ## Якщо кілька шаблонів збігаються, буде використано перший.
    ##
    ## У шаблоні:
    ##
    ## / — це роздільник директорій.
    ##
    ## * — відповідає всім символам, окрім роздільника директорій.
    ##
    ## ** — відповідає всім символам, включаючи роздільник директорій.
    ##
    ## Наприклад, "*.txt" відповідає файлам txt у базовому каталозі,
    ## "game/**.ogg" відповідає файлам ogg у каталозі гри або будь-яких його
    ## підкаталогах, а "**.psd" відповідає файлам psd у будь-якому місці проекту.

    ## Класифікувати файли як None, щоб виключити їх з побудови.

    build.classify('**~', None)
    build.classify('**.bak', None)
    build.classify('**/.**', None)
    build.classify('**/#**', None)
    build.classify('**/thumbs.db', None)

    ## Щоб архівувати файли, класифікуйте їх як 'archive'.

    # build.classify('game/**.png', 'archive')
    # build.classify('game/**.jpg', 'archive')

    ## Файли, що відповідають шаблонам документації, дублюються у побудові для mac,
    ## тому вони з'являються і в додатку, і в zip-файлі.

    build.documentation('*.html')
    build.documentation('*.txt')


## Для здійснення покупок через додаток потрібен ліцензійний ключ Google Play. Його можна
## знайти в консолі розробника Google Play в розділі "Monetize" > "Monetization
## Setup" > "Licensing".

# define build.google_play_key = "..."


## Ім'я користувача та проекту для проекту на itch.io, розділені косою рискою.

# define build.itch_project = "renpytom/echoesofthepast-project"
