# Оголошення персонажів
define i = Character("Я")
define aila = Character("Айла") # Дівчина ельфійка
define mikko = Character("Мікко") # Хлопчик ельф
define anna = Character("Анна") # Дівчина, приблизно однолітки з головним героєм
define andriy = Character("Андрій") # Чоловік середніх років
define sasha = Character("Саша") # Маленький хлопчик
define phone = Character("Телефон")

# Оголошення музичних доріжок
# define audio.idle_music = "audio/Music/Idle.wav"
# define audio.alarm_clock = "audio/Sound/AlarmClock.mp3"

# Оголошення службових змінних
# Змінна лічильника разів підходів до їжі
define eat_counter = 0
# Змінні розмов із людьми
define talk_anna = False
define talk_andriy = False
define talk_sasha = False
# Змінні кінцівок
default persistent.bad_ending = False
default persistent.happy_ending = False

# Оголошення ефекту розплющування та заплющування очей
init python:
    eye_open = ImageDissolve("images/art/eye.png", 0.5, 100)
    eye_close = ImageDissolve("images/art/eye.png", 0.5, 100, reverse=True)
    flash_open = ImageDissolve("images/art/flash_eye.png", 1, 100)
    flash_close = ImageDissolve("images/art/flash_eye.png", 0.75, 100, reverse=True)

label start:
    scene street with fade

    '''
    Схоже я знову провалився.

    Співбесіда знову була дуже душною і абсолютно не результативною.

    Втім, я так кажу, ніби могло бути якось інакше.

    Все ж ринок переповнений, а не досвідчений розробник після універу і даром нікому не потрібен.

    Ще й як на зло компанія знаходиться біля дому де ми жили з батьками до мого повноліття.

    ...

    В принципі, дома мене ніхто не чекає, тож можна трохи і прогулятися місцями мого дитинства.
    '''

    scene street_1 with fade

    '''
    Прогулюючись вулицями, де я провів свої шкільні роки, мозок бомбардували спогади, що немов відлуння минулого не давали мені спокою.

    Будинки, здається, лишились такими ж, як і раніше. Проте тепер вони ніби не можуть мене впізнати, хоча за шкільних часів такого точно не було.

    Ах так, шкільні роки...

    Я так мріяв втекти звідти якомога швидше, що після дев'ятого пішов у коледж.

    Сповнений надій та бажання дійсно чогось навчитись, я на повній швидкості влетів у стіну реальності.

    Коледж за всі чотири роки не дав мені нічого.

    Ні знань. Ні досвіду. Ні друзів.

    Втім, а звідки їм узятись, якщо всі чотири роки ми просиділи на дистанційці...

    Напевно вже тоді я усвідомив, що нічого краще за школу у моєму житті не було.

    У школі я активно займався спортом.

    Ми навіть перемагали на змаганнях районного рівня.

    Я тоді думав, що успіхи були випадковими, і що він був можливий, точно не завдяки мені.

    Проте тепер розумію - я теж докладав чимало зусиль.

    Втім це вже не так і важливо, бо я кинув це все, навіть вже не пам'ятаю на якому році коледжу.

    Та й звідки б чомусь кращому взятись, якщо в при переході в коледж була лише дистанційка.

    А от у школі, то так...

    Ніякого напрягу. На останній парті просто сидиш собі і нічого не робиш.

    Ще й друзі є.

    Не те що зараз...

    А ну і як же про таке можна забути, тоді у моєму житті була Вона.

    Чесно, вже кілька років ловлю себе на думці, що не можу згадати її обличчя, але те, що я точно ніколи не забуду - це її парфум, те якою вона завжди була м'якою та приємною на дотик.

    Втім це вже все у минулому...

    Як і всі хороші часи, напевно...
    '''

    scene court with fade
    
    '''
    За роздумами мене застав рідний двір.

    Він особливо не змінився.

    Навіть ямки на дорозі не залатали.

    Хоча ні, щось таки змінилося.

    Двір відчувається зовсім інакше.

    То що ж це може бути?

    Невже вікна пластикові нарешті встановили?
    '''
    scene underground with vpunch
    scene black with eye_close
    ""
    "."
    ".."
    "..."
    "Як же болить нога..."
    scene underground with eye_open
    '''
    Де це я в біса?!

    Невже якийсь тупорилий сантехнік забув закрити люка по серед дороги?!

    Втім вже не важливо.
    
    Для початку мені треба вибратись, а потім вже будемо вирішувати.

    По землі стелився туман.

    Світло долинало лише з відкритого люка.

    Воно було дуже холодним та покривало дуже маленьку площу.

    Озирнувшись мене дивували ці дивні руїни навколо.

    Хіба має таке бути у звичайній каналізації?

    Втім, а звідки мені знати, як воно має бути у каналізації?

    Я ж з дитинства ріс маминим синочком і навіть на заброшці ні разу не був...

    Покрутившись ще трохи я помітив драбину на гору і вже збирався вибиратись, але в око впало якесь занадто тепле світло.

    Воно долинало з якогось, ніби старовинного коридору.

    Здоровий глузд шепотів мені ігнорувати це і нарешті йти додому.

    Але якийсь чужорідний для мене голос, голос допитливості, що ніколи не прокидався поза домом, просто кричав іти мені на світло, іти в коридор.
    '''
    scene tunnel with fade
    '''
    З кожним кроком коридор ставав все коротшим і коротшим

    Що секунди страх ставав все сильніше і сильніше.
    
    Він обгортав мене, немов липка павутина, але щось не відпускало мене і просувало моє тіло все далі і далі тунелем.

    Я йшов на те неприродно тепле світло, що манило в темряві.
    
    Коридор здавався нескінченним.
    
    Повітря ставало важчим та душнішим.

    Раптом попереду з'явилися величезні двері.
    
    Вони були повністю зроблені із дерева, оббиті залізом та прикрашені дивними символами.
    
    Що це за місце?
    
    Чому тут такі двері?

    Страх сковував моє тіло.
    
    Ноги наче приросли до землі.
    
    Я хотів розвернутися та бігти геть звідси.

    Але світло з-під дверей манило.
    
    Що там всередині?
    
    Чому воно тут у каналізації?
    
    Я мусив дізнатися.

    Зібравши всю свою відвагу, я повільно підійшов до дверей.
    
    Серце калатало, немов ось-ось вискочить з грудей.
    
    Я затамував подих і тремтячою рукою потягну важкі двері на себе.
    '''
    scene white with flash_open
    # scene meeting_0 with flash_close
    scene banquet_hall with flash_close
    show mikko at center
    show aila at left
    '''
    Двері розчинилися, і світло з того боку на мить засліпило мене.

    Коли очі звикли, я зрозумів, що опинився у невеличкій залі площею близько п'яти квадратних метрів.

    Її освітлювали кілька свічок на старовинній люстрі.

    У дальньому кутку виднілися неприродно великі квіти, хоча, можливо, так здавалося через невеликі розміри кімнати.

    Єдиними предметами в залі, окрім квітів та люстри, був величезний стіл, за яким сиділо декілька людей різного віку.

    Раптом вони замовкли та повернулися в мій бік.

    Серед них виділялися хлопчик та дівчинка з витонченими рисами обличчя, гострими вухами та яскравими очима.
    
    Вони нагадали мені якихось казкових ельфів.

    Раптом хлопчик ельф заговорив до мене.
    '''
    # scene meeting_1 with fade
    $ mikko = Character("???")
    $ aila = Character("???")
    mikko "Здрастуй, любий госте. Прошу, проходь до столу, сідай, їж."
    i "Дякую за запрошення. Мене звати..."
    mikko "Імена тут не мають значення. Просто розслабся та насолоджуйся трапезою разом з нами."
    i "Але я хотів би предст..."
    mikko "Ні-ні, не треба ніяких представлень. Ти ще все зрозумієш. Просто сідай та їж - це головне зараз."
    "Чомусь мене зовсім не здивувала ця фраза, і я без зайвих думок підійшов до столу та сів..."
    # scene banquet_hall with fade
    mikko "Їж, їж поки все не охололо."
    "Думки роїлись у моїй голові, але єдине, чого мені дійсно хотілось - це їсти."
    "Я почав накладати собі до тарілки різні страви від яких ломився цей величезний стіл."
    i "Вибачте, можливо вам і не важливо моє ім'я, але я б хотів знати ваші. Чи не могли б ви представитись?"
    mikko "Якщо гість так хоче знати наші імена, то ми не будемо сперечатись."
    mikko "Мене звіти Мікко."
    $ mikko = Character("Мікко")
    aila "А я Айла."
    $ aila = Character("Айла")
    i "Які у вас цікаві імена! Прямо як ельфійські якісь..."
    "Жартома сказав я."
    aila "У чомусь ти навіть правий.{w} Наш батько був ельфом, а ми лише напівкровні ельфи."
    "Чомусь її голос був для мене таким знайомим і приємним, але я не міг зрозуміти де я його чув"
    i "А як їх звати?"
    "Сказав я вказуючи на інших гостей."
    mikko "А це ти і сам можеш дізнатись."
    aila "Так, поговори із ними, я певен вони можуть розповісти щось цікаве..."
    i "Справді?"
    aila "Звісно, до цього місця люди просто так не потрапляють..."
    hide mikko
    hide aila
    "Десь всередині мене щось дуже насторожилось після цієї фрази ельфійки."
    "Після глибокого вдиху та видиху все швидко пройшло. тож я вирішив все ж таки поговорити із іншими гостями."
    "Навпроти мене сидів чоловік середніх років, що потягував різні напої та раз за разом спустошував свій келих."
    "На протилежному від мене краю сиділа дівчина з довгим чорним волоссям, яка не змінюючись в обличчі щось черкала у блокнотику, який вона ховала та діставала кожні кілька хвилин."
    "А біля дверей в які я і увійшов сидів хлопчик, на вигляд років семи, який постійно намагався зачепити ельфів, що відносили та підносили тарілки."
    "Тож до кого мені направитись першим?"
    jump talk_with_everyone
    return

label talk_with_everyone:
    menu:
        "Почати трапезу" if eat_counter == 0:
            if eat_counter == 0:
                "Я обрав невеличку закуску із величезного столу, смакуючи ароматну страву."
            elif eat_counter == 1:
                "Друга страва була ще смачнішою! Я насолоджувався кожним шматочком."
            elif eat_counter == 2:
                "Хоч третя порція йшла важко, але я не міг відмовити собі у задоволенні спробувати ще одну чудову страву!" 
            elif eat_counter == 3:
                "Четверта порція ледь влізла, але які ж були неймовірні смаки! Варто було помучитись!"
            else:
                "Я більше не можу їсти!"
            $ eat_counter = eat_counter + 1
            jump talk_with_everyone
        "Повернутись до трапези" if eat_counter > 0:
            if eat_counter == 0:
                "Я обрав невеличку закуску із величезного столу, смакуючи ароматну страву."
            elif eat_counter == 1:
                "Друга страва була ще смачнішою! Я насолоджувався кожним шматочком."
            elif eat_counter == 2:
                "Хоч третя порція йшла важко, але я не міг відмовити собі у задоволенні спробувати ще одну чудову страву!" 
            elif eat_counter == 3:
                "Четверта порція ледь влізла, але які ж були неймовірні смаки! Варто було помучитись!"
            else:
                "Я більше не можу їсти!"
            $ eat_counter = eat_counter + 1
            jump talk_with_everyone
        "Поговорити із чоловіком навпроти" if talk_andriy == False:
            $ andriy = Character("???")
            show andriy at center
            i "Добридень, чи можу я приєднатись до вас?"
            andriy "Так, сідай..."
            i "Як вас звати?"
            andriy "Мене звуть Андрій. Радий познайомитися."
            $ andriy = Character("Андрій")
            i "Навзаєм."
            "Андрій, схоже, був не сильно налаштований на спілкування."
            "Він не брав їжі, тільки пив і пив."
            "Я вирішив розірвати мовчанку та запитав."
            i "Розкажете як ви сюди потрапили?"
            andriy "Це довга історія... Та ще й не надто цікава."
            i "І все ж розкажіть, у нас тут схоже ціла ніч попереду..."
            "Він глянув на мене своїми глибоко сірими очам та промовив."          
            andriy "Не розумію, нащо воно тобі потрібно, але якщо ти вже так хочеш почути то я не буду заперечувати."
            andriy "Я успішний бізнесмен, маю власну фірму. Весь час присвячував роботі, щоб досягти успіху."
            i "То ви досягли своєї мети?"
            andriy "Так, у мене є гроші та статус... Але за це довелося заплатити дуже високу ціну."
            andriy "Я втратив усе особисте життя. Немає часу на сім'ю, друзів. Лише робота з ранку до ночі."
            "Я не знав, що йому відповісти тому просто промовчав"
            "Андрію ж, схоже не надто потрібна була моя реакція тож він продовжив."
            andriy "Так, гроші не замінять людського тепла та щастя. Але тепер вже запізно щось змінювати."
            i "Мабуть, ніколи не пізно почати все спочатку?{w} Втім не мені про таке казати..."
            "Він лише важко зітхнув у відповідь."
            andriy "Сьогодні зранку мені було занадто якось гидко від того всього, тож я вирішив не їхати на роботу."
            andriy "Сьогодні мала бути робоча зустріч із партнерами аби підписати контракт, який фактично озолотив би мене, але мені було так гидко від однієї лише думки про те що мені доведеться спілкуватись із тими всіма людьми, які так само як і я відкладають усе життя на потім аби тільки заробити по більше..."
            andriy "З рештою я вирушив до лісопосадки в сусідньому районі та просто блукав там весь день, аж раптом спіткнувся об якийсь корінь та полетів до землі."
            andriy "Прокинувся я вже у підземеллі."
            andriy "Єдине світло що було йшло з якогось коридору, тож я й пішов на нього в надії знайти людей."
            andriy "І ось я тут...{w} П'ю..."
            "Він знову важко зітхнув та втупився в свій келих"
            "Було абсолютно точно зрозуміло, що спілкуватись далі він не хоче, тож я повернувся"
            hide andriy at center
            $ talk_andriy = True
            jump talk_with_everyone
        "Поговорити із хлопчиком біля дверей" if talk_sasha == False:
            $ sasha = Character("???")
            show sasha at center
            i "Привіт! Як тебе звати?"
            sasha "Я Сашко. А ти один із ельфів?"
            $ sasha = Character("Сашко")
            i "Ні-ні, я не один із ельфів, я просто гість, як вони кажуть."
            sasha "Зрозуміло. А розкажеш як ти сюди попав?"
            i "Та я в люк упав, і потім побачив якісь двері, то й зайшов сюди."
            sasha "Так... Щось не дуже цікаво."
            sasha "А я от якось уві сні сюди прийшов!" 
            sasha "Уявляєш собі, прокидаюсь - а тут підземка!"
            i "То ти втік з дому типу?"
            sasha "Ні. Я просто заснув, а прокинувся тут."
            sasha "Але я тут не сумую! Тут я зустрів Анну і ельфів - вони класні!"
            sasha "Ми тепер друзі! Разом їмо смачну їжу за столом!"
            if talk_anna == False:
                i "Вибач, а хто така ця Анна?"
                sasha "Та, он вона сидить. З волоссям догми."
                i "А, зрозумів."
                i "Вибач що перебив. Продовжуй"
                sasha "Та в принципі, я наче все і розказав."
            i "Добре, але як же батьки? Вони ж напевно переживають за тебе. Може тебе додому провести?"
            sasha "Та ні. У мене немає дому. Вихователька сказала, що батьки мене залишили в коробці на вулиці коли я тільки народився."
            i "То ти з дитбудинку?"
            sasha "Ні. Тепер я живу тут. Там не весело. А тут весело!"
            sasha "Ну всьо, я знову хочу їсти. Тож не заважай."
            "Я вже почав відходити від малюка, як він кинув мені навздогін."
            sasha "А, і філе, оце, смажене, не чіпай! Воно моє. Я вже з ельфами домовився!"
            i "Ага. Добре."
            "Я все ж повернувся на своє місце."
            hide sasha at center
            $ talk_sasha = True
            jump talk_with_everyone
        "Поговорити із дівчиною з краю столу" if talk_anna == False:
            show anna at center
            $ anna = Character("???")
            if talk_sasha == True:
                $ anna = Character("Анна")
                i "Вибач, ти ж Анна?"
                anna "Так, а ти звідки знаєш?"
                i "Та тільки що з Сашком розмовляв, каже що ти класна."
                anna "А, той малий. Так підходив щось розказував.. Втім а яка там різниця."
                i "Та так..."
                "Між нами запанувала тиша."
                "Напевно дистанційка все ж давалась взнаки і тут..."
                i "Схоже розмова зайшла у глухий кут, тож давай почнемо з початку."
            i "Привіт! Як справи?"
            anna "Емм, та нічого, все нормально..."
            $ anna = Character("Анна")
            i "Справді? Якось ти не дуже впевнено сказала."
            anna "Ні, зі мною все гаразд, не переймайся."
            i "Я бачу, що щось тебе турбує. Можеш розповісти мені, якщо хочеш."
            anna "Ні-ні, все добре..."
            i "Не виглядає, що все добре. Я готовий вислухати, якщо потрібно виговоритися."
            anna "Ну... Якщо ти наполягаєш... Хоча, напевно, тобі буде нецікаво слухати мої проблеми."
            i "Абсолютно ні! Розповідай, я з цікавістю послухаю."
            anna "Ну гаразд... Тільки обіцяй, що не будеш сміятися..."
            i "Обіцяю, розповідай спокійно."
            anna "Отож... З дитинства я мріяла стати художницею..."
            anna "Закінчила художню школу, академію мистецтв... А тепер вимушена малювати на замовлення, щоб якось вижити."
            anna "Я вже втратила натхнення... Мої картини виходять бездушними."
            anna "Просто не знаю, що робити далі... Мистецтво більше не приносить мені радості."
            i "Розумію... Я теж колись таким був."
            anna "Угу"
            "Натужно прягла вона. А я не міг вичавити із себе ні якого підбадьорення, нічого."
            if talk_sasha == True:
                i "До речі. Ти ж тут довше всіх, так?"
                anna "А ну так, я сюди перша \"прийшла\""
                i "То вже щось цікаве бачила, чи може ельфи щось розповідали?"
                anna "Та ні, вони між собою постійно шушукають і тільки і міняють їжу."
                i "Зрозуміло. Ну то дякую за інформацію. Може якось віддячу тобі."
                "Жартома кинув я."
                anna "Та, ні не варто."
                anna "І щоб ти знав. Якщо це був спосіб взяти у мене номер, то це було дійсно безглуздо."
                i "Зрозумів."
            "З рештою я повернувся на своє місце."
            hide anna at center
            $ talk_anna = True
            jump talk_with_everyone
        "Поговорити із Айлою та Мікко":
            show mikko at left
            show aila at right
            mikko "То, поговорив із усіма?"
            if talk_andriy == True and talk_anna == True and talk_sasha == True:
                i "Так."
                aila "І як тобі? Я була права що буде цікаво?"
                i "Так, наче так. Але вони всі якісь нещасні.{w} Як...{w} Як я..."
                aila "В цьому і є наш секрет. Сюди не можуть попасти щасливі люди. Ми з Мікко створили це місце, щоб допомагати таким, як ти, і як вони..."
                mikko "Чекай-чекай. Далі ще рано розповідати."
                i "Та, ну тобі що шкода?"
                mikko "Ні-ні, просто краще деякі таємниці залишити на потім."
                mikko "А поки залиш все це і просто насолоджуйся."
            else:
                i "Ні. Мені чесно кажучи не було так вже цікаво."
                aila "А я думала, тобі сподобається..."
                aila "Ну добре. Тоді не бери це все дурне до голови та насолоджуйся трапезою."
            i "Ага, дякую."
            "Позіхаючи сказав я."
            jump final_choice
    return

label final_choice:
    scene black with eye_close
    scene banquet_hall with eye_open
    "Я вже щиро кажучи не знаю, скільки часу минуло з того моменту, як я сюди потрапив."
    "Їжа та напої постійно поновлювалася ельфами, проте я відчув, що вже занадто пізно і пора збиратися додому."
    i "Мікко, Айла, дуже дякую за гостинність, але, мабуть, мені вже час."
    show mikko at right
    show aila at left
    mikko "Ні-ні, куди поспішати? Залишайся ще."
    aila "Так, лишайся з нами. Нам так приємно що ти тут разом з нами."
    "На мій подив після цих слів усе моє бажання йти одразу ж зникло, ніби його й не було."
    i "Гаразд, трішки ще побуду."
    aila "Чудово! Ми дуже раді."
    "Усмішка Айли, з якою вона це сказала, зігріла моє серце."
    "Як і тоді, у школі..."
    "Намагаючись відкинути ці думки я проковтнув чергову картоплину, я поглянув на Андрія."
    "Схоже, йому вже справді було досить."
    "Він хитався на стільці, намагаючись щось белькотіти неслухняним язиком."
    i "Ей, Мікко, здається, хлопцеві вже вистачить. Може, викличемо йому таксі?"
    mikko "Та ні не треба, зараз ми з Айлою його вкладемо."
    i "Ну добре."
    "Мікко та Айла підійшли до Андрія ззаду, поплескали його по плечу і щось прошепотіли йому на вухо."
    "Він раптом підвівся і попрямував до кімнати, у бік величезних квітів."
    "Раптом одна квітка розкрилася просто перед ним, наче лев, що роззявляє пащу, і завмерла в очікуванні."
    "Андрій обережно ліг всередину, заплющивши очі."
    "В ту ж мить квітка стулила пащу і знов стала звичайним бутоном."
    i "Що це, до біса, було?!"
    "Вигукнув я з переляку в бік ельфів."
    mikko "Та нічого. Він просто ліг спати."
    "Абсолютно спокійно відповів Мікко."
    "Я аж закипів від побаченого."
    i "Та ж квітка щойно його проковтнула!"
    mikko "Про що ти? Це звичайне ліжко. Чи, може, тобі теж зле?"
    mikko "Хоча, якщо дуже цікаво, можу розповісти тобі таємницю..."
    mikko "Це застілля влаштоване не просто так. Згодом ти все зрозумієш."
    mikko "Коли будеш готовий, ми тебе про дещо запитаємо. А поки що просто розважайся, любий гостю."
    i "Гаразд, зрозумів."
    scene black with eye_close
    scene banquet_hall with eye_open
    "Черговий раз розплющивши очі я помітив, що нікого за столом вже не залишилось."
    "Ні Анни, ні Сашка вже не було, тільки Мікко та Айла крутились довкола столу знову і знову замінюючи страви на столі."
    show mikko at left
    show aila at right
    i "Мікко, Айло, я вже напевно піду. Я якось трохи втомився. Тож до побачення."
    mikko "Стій, гостю. Залишися ще не надовго. У нас ще залишилось кілька цікавих страв для тебе."
    i "Та, ні дякую. Я вже відчуваю, що не зможу більше їсти. Тож я напевно піду."
    aila "Ні-ні. Нащо кудись іти, відпочинь тут. Он остання квітка вже готова прийняти тебе, щоб ти нарешті відпочив."
    i "Велике вам дякую, але я не хочу вас ще якось напружувати, тож я напевно піду. Скільки я маю заплатити за це все?"
    mikko "Жодних грошей тут. Не ображай нас такими речами."
    aila "Залишайся. Хіба ти не хочеш відпочити?"
    aila "Ми ж ельфи, якщо ти не знав уміємо створювати сни, тож зможемо зробити так щоб ти провів уві сні ціле життя з найприємнішими моментами."
    "Вони почали обходити мене з обох боків та заходити за спину."
    aila "Хіба ти не хочеш знову відчути те що відчував тоді?"
    aila "Невже ти не хочеш знову відчути себе щасливим?"
    aila "Невже ти не хочеш щоб Вона відповіла тобі взаємністю?"
    mikko "То що скажеш, любий гостю?"
    menu:
        "Погодитись":
            jump bad_end
        "Відмовитись":
            jump happy_end
    return

label bad_end:
    i "Я згоден."
    aila "От і чудово. Там усе готове."
    i "Добре, спасибі за турботу."
    hide mikko
    hide aila
    "Не зважаючи на всю ту втому, що накопичилась моєму тілі ноги несли мене до того краю кімнати де величезна квітка вже відкрила пащу аби прийняти мене."
    "Страху не було."
    "Я просто йшов уперед у пащу квітки."
    "Я відчував тільки приємне передчуття, того що я знову відчую те що і раніше, те що так давно втратив."
    scene black with eye_close
    "Паща квітки закрилась і я почав відчувати, що втома бере гору."
    "Я засинаю"
    "..."
    "Перед очима починають оживати приємні картини минулого."
    "Я знову опиняюся у знайомому класі, за своєю звичною партою. Навколо чути неголосне гудіння учнів та скрип крейди по дошці."
    "Поруч сидять мої старі друзі. Ми перешіптуємось, обмінюємося жартами і тихенько сміємося, намагаючись не привертати увагу вчителя."
    "Раптом я відчуваю на собі чийсь погляд. Піднімаю очі і бачу Її. Вона посміхається мені тією чарівною посмішкою, яку я пам'ятаю досі."
    "Ми разом, щасливі. Я нарешті збираюся з силами і кажу їй те, про що давно мріяв - зізнаюся у коханні. І чую у відповідь те саме!"
    "Неймовірне блаженство огортає все моє єство. Я по-справжньому щасливий!"
    "Але раптом... десь здалеку чую голоси Мікко та Айли."
    mikko "Гарний сьогодні улов."
    aila "І не кажи. Аж чотирьох зловили. Давно такого не було."
    mikko "Це точно..."
    aila "Нам того напевно до кінця зими вистачить!"
    "Я розумію, що сон всього лише приманка для цієї пастки."
    "Квітка починає заповнюватися липкою рідиною, що стискає мене."
    "Але я встиг на мить відчути щастя. І цього достатньо."
    "Я засинаю востаннє."
    window hide
    pause
    if persistent.bad_ending == False:
        $ renpy.notify("Кінцівку \"Порожній\" здобуто")
        $ persistent.bad_ending = True
    return

label happy_end:
    i "Вибачте, але я все ж відмовлюсь."
    aila "Що? Ти не можеш відмовитись! Ти маєш залишитись тут, із нами!"
    i "Я кажу ні!"
    i "Я не хочу лишитись на вічно у минулому!"
    i "Я хочу жити далі!"
    "Я різко ривком кинувся до виходу, намагаючись якомога швидше втекти звідси."
    hide mikko
    hide aila
    "Але ноги наче налилися свинцем, кожен крок давався вкрай важко."
    "Тіло ніби розпухло від усієї їжі, яку я похапцем закидав в себе за столом. Але зупинятися я не міг!"
    mikko "Схопіть його!"
    "М'язи не слухалися, але я продовжував рухатися вперед, віддаляючись від переслідувачів."
    scene tunnel with fade
    "Нарешті я добіг до коридору і щодуху кинувся туди."
    scene underground with fade
    "Опинившись у каналізаційному відсіку, я миттєво схопився за драбину."
    "Туман внизу почав розсіюватися, і я якомога швидше поліз нагору, на поверхню."
    "Ледь чутно знизу долинув розчарований вигук Мікко:"
    mikko "От лихо, втік! Ну нічого, трьох нам вистачить."
    scene court with fade
    "Зрештою я вибрався на вулицю та щодуху припустив геть звідти."
    "Озирнувшись, я не побачив ні сліду ельфів, ні люка за собою."
    "Але від гріха подалі я вирішив не зупинятися, а якомога швидше віддалитися."
    scene black with eye_close
    scene court with eye_open
    "Нарешті я доставив ці прокляті документи в офіс! Думав, вони їх ніколи не приймуть."
    "Тепер я можу спокійно повертатися додому."
    "Але раз я вже тут, то пройдуся трохи знайомими місцями - до іншої зупинки."
    "Я минув двір, де колись ледь не потрапив у пастку. Тепер тут все спокійно."
    "Невдовзі попереду з'явилася автобусна зупинка. Я пришвидшив крок."
    init python:
        import os
        user_name = os.environ.get("USERNAME")
    phone "Привіт, [user_name], ти вже скоро будеш?"
    i "Так, вже майже на зупинці, кохана."
    phone "Чудово, чекаю! А, і не забудь купити цукерок для моїх батьків."
    i "Звісно, обов'язково куплю. Скоро побачимося!"
    "Я усміхнувся, згадавши нещодавні події. Якби я тоді погодився залишитися у минулому, то ніколи б не дізнався, яке прекрасне життя мене чекає."
    scene street with fade
    "Тому тепер я дивлюся лише вперед і живу сьогоденням."
    "З цими думками я сів у свій автобус, що віз мене назустріч майбутньому, а не минулому."
    window hide
    pause
    if persistent.happy_ending == False:
        $ renpy.notify("Кінцівку \"Новий шлях\" здобуто")
        $ persistent.happy_ending = True
    return